



:e file1.txt   //切换到另一个文件

: r !head - 10 xxx  //读xxx的前10行到当前文件
: r  xxx   把xxx全读进来



:%s/old_text/new_text/g    //替换当前文件的字符串


:/xx   查找xx


i表示从前面插入，a表示从后面追加，shift+a是在当前行尾追加，shift+i表示行首追加


<CR>表示回车     <nop>表示无

f+字符   跳转到当前行的该字符位置

c i + xx 表示在xx中重新编辑   比如  c i <>   就会删除<>的所有内容，然后重新进入编辑模式
同理，y i + xx表示在xx中复制    d i + xx 表示删除xx中的内容


x表删除，可以前面加个数字表示要删除的个数

w和e都是光标右移，一次移动一个字符串

y f :   复制，寻找:  表示复制:前的所有字符，包括:



shift+v进入可视模式后，按：可以进入可是模式的命令行模式，按normal 后可以接命令
比如 shift+i在行首编辑  3x删除3个位置字符，也可以配合使用 比如先x删除 后接 大写I 接编辑内容



  n+ctrl+w+大于或者小于   调整分屏模式下当前窗口的大小，实际被映射为 ctrl+箭头


  在命令模式下输入 : tabe 后跟文件名来打开一个文件,也可以没文件名